ФитнесПроект/Catalogs/Абонементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Абонементы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заморозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейЗаморозки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ФитнесПроект/Catalogs/Абонементы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеАбонимента();
	КонецЕсли;
	
	РасчитатьОкончаниеАбонимента();
	
	ПерерасчетДнейЗаморозки();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеАбонимента()
	
	Если ЗначениеЗаполнено(Объект.Владелец) И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Наименование = Элементы.Владелец.ВыделенныйТекст + " (" + Элементы.Номенклатура.ВыделенныйТекст + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Владелец) И НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Наименование = Элементы.Владелец.ВыделенныйТекст + "( )";
	Иначе
		Объект.Наименование = "(" + Элементы.Номенклатура.ВыделенныйТекст + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьОкончаниеАбонимента()
	
	Объект.ДатаОкончания  = ДобавитьМесяц(Объект.ДатаАктивации,Объект.СрокДействия) + (Объект.Заморозки.Итог("ДнейЗаморозки") * 86400);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПерерасчетДнейЗаморозки()
	
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки - Объект.Заморозки.Итог("ДнейЗаморозки");
	
КонецПроцедуры 

&НаКлиенте
Процедура РасчитатьДнейЗаморозкиТЧ()
	
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;		
	СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания  - СтрокаТЧ.ДатаНачала) / 86400;
	
	Если СтрокаТЧ.ДнейЗаморозки > Объект.ОстатокДнейЗаморозки Тогда
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + (Объект.ОстатокДнейЗаморозки * 86400);
		СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания  - СтрокаТЧ.ДатаНачала) / 86400;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктивацииПриИзменении(Элемент)
	
	РасчитатьОкончаниеАбонимента()
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	РасчитатьОкончаниеАбонимента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДнейЗаморозкиПриИзменении(Элемент)    
	
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаморозкиДатаНачалаПриИзменении(Элемент)
	
	РасчитатьДнейЗаморозкиТЧ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
	
	РасчитатьДнейЗаморозкиТЧ();
	
	РасчитатьОкончаниеАбонимента();
	
	ПерерасчетДнейЗаморозки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	СформироватьНаименованиеАбонимента();	
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СформироватьНаименованиеАбонимента();
	
КонецПроцедуры
